{"id":"about","title":"Sitebricks","html":"<p>Sitebricks is a simple, fast development layer for Java web apps. It is built on top of <a href=\"http://code.google.com/p/google-guice\">Guice</a> and follows many of the same principles of type-safety and conciseness.</p> \n<p>Sitebricks offers several modules that fit various kinds of web development needs including Web Services, Templating, Mail, HTTP Clients, and more. Sitebricks is maintained by an active community of developers and is open source software available under the <a href=\"http://www.apache.org/licenses/LICENSE-2.0.html\">Apache license</a>. You are free to use Sitebricks in commercial and hobby projects, with no copyright restrictions or fees.</p> \n<p>If you have questions, send a message to the friendly folk on our <a href=\"http://groups.google.com/group/google-sitebricks\">mailing list</a>. Sitebricks was created by <a href=\"http://twitter.com/dhanji\">Dhanji R. Prasanna</a>, while at Google.</p> \n<h3>Contributors</h3> \n<p>A sincere word of thanks to all our great contributors. In no particular order:</p> \n<ul> \n <li>Jason van Zyl - Releases Sitebricks to Maven Central and provides many contributions</li> \n <li>Jean-Francois Arcand - Sitebricks Client/AHC and RESTful Webservices SPI features</li> \n <li>Bradley Dwyer - Page redirects, PUT/DELETE handling from browsers and much more</li> \n <li>John D Patterson - Improvements to Bricks support, Sitebricks conversion API</li> \n <li>Fred Faber - Sitebricks Stats module</li> \n <li>Shawn O'Connor - HTML parser and template generator (using JSoup)</li> \n <li>Joseph Ottinger - Initial Maven project setup</li> \n <li>Jared Rodriguez - Sitebricks conversion API</li> \n</ul> \n<p>And special mention thanks to:</p> \n<ul> \n <li>Mike Brock - for MVEL support requests</li> \n <li>Bob Lee - for Guice, and giving me the idea for type-safe templating in Sitebricks</li> \n <li>JAX-RS expert group - for incorporating many of Sitebricks' ideas into the spec</li> \n</ul>","postedOn":"12 Dec 2011"}